##### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series

In [1]:
import pandas as pd

In [2]:
data = [4,8,15,16,23,42]

In [3]:
s = pd.Series(data)

In [4]:
s

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#### variable print it.

In [5]:
l = [7,9,0,3,5,3,1,5,3,6]

In [6]:
sl = pd.Series(l)

In [7]:
sl

0    7
1    9
2    0
3    3
4    5
5    3
6    1
7    5
8    3
9    6
dtype: int64

In [8]:
type(sl)

pandas.core.series.Series

####  Q3. Create a Pandas DataFrame that contains the following data:

In [9]:
Names = ["Alice", "Bob", "Claire"]
Ages = [25,30,27]
Genders = ["Female", "Male", "Female"]

In [15]:
df = pd.DataFrame({
    "Name": names,
    "Age": ages,
    "Gender": genders
})

In [16]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [17]:
players = ["rohit", "virat", "dhoni","sachin"]
matchs = [303, 350, 400, 430]
runs = [9000, 10000, 11000, 15000]
mostsixs = [300, 250, 280, 200]
centurys = [ 41, 75, 16, 100]

In [18]:
df1 = pd.DataFrame({
    "Player": players,
    "Match": matchs,
    "Run": runs,
    "Mostsix": mostsixs,
    "century": centurys
})

In [19]:
df1

   Player  Match    Run  Mostsix  century
0   rohit    303   9000      300       41
1   virat    350  10000      250       75
2   dhoni    400  11000      280       16
3  sachin    430  15000      200      100

In [20]:
type(df1)

pandas.core.frame.DataFrame

In [21]:
df1.columns

Index(['Player', 'Match', 'Run', 'Mostsix', 'century'], dtype='object')

In [27]:
df1[ 'Match']

0    303
1    350
2    400
3    430
Name: Match, dtype: int64

In [28]:
type(df1[ 'Match'])

pandas.core.series.Series

### Q7. Create a DataFrame using multiple Series. Explain with an example

In [1]:
import pandas as pd
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([6, 7, 8, 9, 10])
s3 = pd.Series([11, 12, 13, 14, 15])

In [2]:
df3 = pd.DataFrame({
    "s1": s1,
    "s2": s2,
    "s3": s3
})

In [3]:
df3

   s1  s2  s3
0   1   6  11
1   2   7  12
2   3   8  13
3   4   9  14
4   5  10  15

In [4]:
df3 = pd.concat([s1, s2, s3], axis=1)

In [5]:
df3

   0   1   2
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15